In [1]:
import numpy as np
import pandas as pd

In [4]:
ser = pd.Series(np.random.randn(5), index = ['a', 'b', 'c', 'd', 'e'])
print(ser)

a   -2.888440
b   -1.068199
c    0.594767
d   -0.731203
e    0.356744
dtype: float64

above is a one dimensional array, despite it looking like a table because of the index values.  series can't have a header because that would make it a 2d array since the header becomes the new axis.  a dataframe is 2d so it can have headers.

the letters are the index labels. the index values are still enumerated in order.

In [7]:
d = {'b':1, "a":0, "c":2}
pd.Series(d)

b    1
a    0
c    2
dtype: int64

this is one column, still.  the index of the series are the keys of the dict.

DATAFRAMES

In [12]:
data = { 'apple sales': [3, 2, 0, 1, 6, 9], 'orange sales': [3, 2, 3, 4, 5, 3]}

#df_sales = pd.DataFrame(data, index=['2000', '2001', '2002', '2003', '2004', '2005'])
df_sales = pd.DataFrame(data, index=range(2000,2006))

df_sales

      apple sales  orange sales
2000            3             3
2001            2             2
2002            0             3
2003            1             4
2004            6             5
2005            9             3

In [13]:
df_sales.loc[2002]
#this returns a series.  so if you save it to a variable you could do series manipulation
#if there are two results with 2002 label then all rows with that label would be returned
#and it would be returned as a dataframe

apple sales     0
orange sales    3
Name: 2002, dtype: int64

In [14]:
df_sales.iloc[1]

apple sales     2
orange sales    2
Name: 2001, dtype: int64

In [15]:
df_sales.iloc[1:3]

      apple sales  orange sales
2001            2             2
2002            0             3

In [ ]:
df_sales.insert(1, 'pineapple sales', [5,4,4,6,7,2])

In [17]:
df_sales

      apple sales  pineapple sales  orange sales
2000            3                5             3
2001            2                4             2
2002            0                4             3
2003            1                6             4
2004            6                7             5
2005            9                2             3